phygeonet-master/case3/TemplateCase/system/blockMeshDict
// Parametrized windTunnel

//Run using:
//m4 -P blockMeshDict.m4 > blockMeshDict

//m4 definitions:

//Mathematical constants:


//m4 spec:


//plane A settlingChamberInlet


//plane B contractionInlet


//plane C testSectionInlet


//plane D diffuserInlet


//plane E fanInlet


//plane F fanOutlet


//plane z:


//spline:


/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
	// front side
	(-0.5 -0.5 0) // Vertex A0 = 0 
	(0.5 -0.5 0) // Vertex B0 = 1 
	(0.5 0.5 0) // Vertex B1 = 2 
	(-0.5 0.5 0) // Vertex A1 = 3 

	// back side	
	(-0.5 -0.5 0.01) // Vertex A3 = 4 
	(0.5 -0.5 0.01) // Vertex B3 = 5 
	(0.5 0.5 0.01) // Vertex B2 = 6 
	(-0.5 0.5 0.01) // Vertex A2 = 7 

);

blocks          
(
    // stenosis domain	
    hex (0 1 2 3 4 5 6 7) (50 50 1) simpleGrading (1 1 1)
);

edges           
(
spline 0 3
(
(-5.000000000000000000e-01 -4.803921568627451122e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -4.607843137254902244e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -4.411764705882352811e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -4.215686274509803932e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -4.019607843137255054e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -3.823529411764705621e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -3.627450980392156743e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -3.431372549019607865e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -3.235294117647058987e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -3.039215686274510109e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -2.843137254901960675e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 -2.647058823529411797e-01 0.000000000000000000e+00)
(-5.061590117112341192e-01 -2.450980392156862919e-01 0.000000000000000000e+00)
(-5.306783309757371336e-01 -2.254901960784313486e-01 0.000000000000000000e+00)
(-5.547325980144166557e-01 -2.058823529411764608e-01 0.000000000000000000e+00)
(-5.779571746585359104e-01 -1.862745098039215730e-01 0.000000000000000000e+00)
(-5.999999999999999778e-01 -1.666666666666666852e-01 0.000000000000000000e+00)
(-6.205269272758512367e-01 -1.470588235294117974e-01 0.000000000000000000e+00)
(-6.392267891925853540e-01 -1.274509803921568540e-01 0.000000000000000000e+00)
(-6.558161149051340288e-01 -1.078431372549019662e-01 0.000000000000000000e+00)
(-6.700434271459227986e-01 -8.823529411764707842e-02 0.000000000000000000e+00)
(-6.816930543639048157e-01 -6.862745098039213509e-02 0.000000000000000000e+00)
(-6.905884000854313198e-01 -4.901960784313724728e-02 0.000000000000000000e+00)
(-6.965946199367804015e-01 -2.941176470588235947e-02 0.000000000000000000e+00)
(-6.996206657474088875e-01 -9.803921568627471661e-03 0.000000000000000000e+00)
(-6.996206657474088875e-01 9.803921568627416150e-03 0.000000000000000000e+00)
(-6.965946199367804015e-01 2.941176470588235947e-02 0.000000000000000000e+00)
(-6.905884000854313198e-01 4.901960784313730279e-02 0.000000000000000000e+00)
(-6.816930543639048157e-01 6.862745098039213509e-02 0.000000000000000000e+00)
(-6.700434271459227986e-01 8.823529411764707842e-02 0.000000000000000000e+00)
(-6.558161149051341399e-01 1.078431372549019107e-01 0.000000000000000000e+00)
(-6.392267891925853540e-01 1.274509803921568540e-01 0.000000000000000000e+00)
(-6.205269272758512367e-01 1.470588235294117974e-01 0.000000000000000000e+00)
(-6.000000000000000888e-01 1.666666666666666297e-01 0.000000000000000000e+00)
(-5.779571746585359104e-01 1.862745098039215730e-01 0.000000000000000000e+00)
(-5.547325980144166557e-01 2.058823529411764053e-01 0.000000000000000000e+00)
(-5.306783309757371336e-01 2.254901960784313486e-01 0.000000000000000000e+00)
(-5.061590117112341192e-01 2.450980392156862919e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 2.647058823529411242e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 2.843137254901960675e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 3.039215686274510109e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 3.235294117647058432e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 3.431372549019607865e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 3.627450980392157298e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 3.823529411764705621e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 4.019607843137255054e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 4.215686274509803377e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 4.411764705882352811e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 4.607843137254902244e-01 0.000000000000000000e+00)
(-5.000000000000000000e-01 4.803921568627450567e-01 0.000000000000000000e+00)
)
spline 4 7
(
(-5.000000000000000000e-01 -4.803921568627451122e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -4.607843137254902244e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -4.411764705882352811e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -4.215686274509803932e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -4.019607843137255054e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -3.823529411764705621e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -3.627450980392156743e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -3.431372549019607865e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -3.235294117647058987e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -3.039215686274510109e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -2.843137254901960675e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 -2.647058823529411797e-01 1.000000000000000021e-02)
(-5.061590117112341192e-01 -2.450980392156862919e-01 1.000000000000000021e-02)
(-5.306783309757371336e-01 -2.254901960784313486e-01 1.000000000000000021e-02)
(-5.547325980144166557e-01 -2.058823529411764608e-01 1.000000000000000021e-02)
(-5.779571746585359104e-01 -1.862745098039215730e-01 1.000000000000000021e-02)
(-5.999999999999999778e-01 -1.666666666666666852e-01 1.000000000000000021e-02)
(-6.205269272758512367e-01 -1.470588235294117974e-01 1.000000000000000021e-02)
(-6.392267891925853540e-01 -1.274509803921568540e-01 1.000000000000000021e-02)
(-6.558161149051340288e-01 -1.078431372549019662e-01 1.000000000000000021e-02)
(-6.700434271459227986e-01 -8.823529411764707842e-02 1.000000000000000021e-02)
(-6.816930543639048157e-01 -6.862745098039213509e-02 1.000000000000000021e-02)
(-6.905884000854313198e-01 -4.901960784313724728e-02 1.000000000000000021e-02)
(-6.965946199367804015e-01 -2.941176470588235947e-02 1.000000000000000021e-02)
(-6.996206657474088875e-01 -9.803921568627471661e-03 1.000000000000000021e-02)
(-6.996206657474088875e-01 9.803921568627416150e-03 1.000000000000000021e-02)
(-6.965946199367804015e-01 2.941176470588235947e-02 1.000000000000000021e-02)
(-6.905884000854313198e-01 4.901960784313730279e-02 1.000000000000000021e-02)
(-6.816930543639048157e-01 6.862745098039213509e-02 1.000000000000000021e-02)
(-6.700434271459227986e-01 8.823529411764707842e-02 1.000000000000000021e-02)
(-6.558161149051341399e-01 1.078431372549019107e-01 1.000000000000000021e-02)
(-6.392267891925853540e-01 1.274509803921568540e-01 1.000000000000000021e-02)
(-6.205269272758512367e-01 1.470588235294117974e-01 1.000000000000000021e-02)
(-6.000000000000000888e-01 1.666666666666666297e-01 1.000000000000000021e-02)
(-5.779571746585359104e-01 1.862745098039215730e-01 1.000000000000000021e-02)
(-5.547325980144166557e-01 2.058823529411764053e-01 1.000000000000000021e-02)
(-5.306783309757371336e-01 2.254901960784313486e-01 1.000000000000000021e-02)
(-5.061590117112341192e-01 2.450980392156862919e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 2.647058823529411242e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 2.843137254901960675e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 3.039215686274510109e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 3.235294117647058432e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 3.431372549019607865e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 3.627450980392157298e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 3.823529411764705621e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 4.019607843137255054e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 4.215686274509803377e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 4.411764705882352811e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 4.607843137254902244e-01 1.000000000000000021e-02)
(-5.000000000000000000e-01 4.803921568627450567e-01 1.000000000000000021e-02)
)
spline 1 2
(
(5.000000000000000000e-01 -4.803921568627451122e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -4.607843137254902244e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -4.411764705882352811e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -4.215686274509803932e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -4.019607843137255054e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -3.823529411764705621e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -3.627450980392156743e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -3.431372549019607865e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -3.235294117647058987e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -3.039215686274510109e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -2.843137254901960675e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 -2.647058823529411797e-01 0.000000000000000000e+00)
(5.061590117112341192e-01 -2.450980392156862919e-01 0.000000000000000000e+00)
(5.306783309757371336e-01 -2.254901960784313486e-01 0.000000000000000000e+00)
(5.547325980144166557e-01 -2.058823529411764608e-01 0.000000000000000000e+00)
(5.779571746585359104e-01 -1.862745098039215730e-01 0.000000000000000000e+00)
(5.999999999999999778e-01 -1.666666666666666852e-01 0.000000000000000000e+00)
(6.205269272758512367e-01 -1.470588235294117974e-01 0.000000000000000000e+00)
(6.392267891925853540e-01 -1.274509803921568540e-01 0.000000000000000000e+00)
(6.558161149051340288e-01 -1.078431372549019662e-01 0.000000000000000000e+00)
(6.700434271459227986e-01 -8.823529411764707842e-02 0.000000000000000000e+00)
(6.816930543639048157e-01 -6.862745098039213509e-02 0.000000000000000000e+00)
(6.905884000854313198e-01 -4.901960784313724728e-02 0.000000000000000000e+00)
(6.965946199367804015e-01 -2.941176470588235947e-02 0.000000000000000000e+00)
(6.996206657474088875e-01 -9.803921568627471661e-03 0.000000000000000000e+00)
(6.996206657474088875e-01 9.803921568627416150e-03 0.000000000000000000e+00)
(6.965946199367804015e-01 2.941176470588235947e-02 0.000000000000000000e+00)
(6.905884000854313198e-01 4.901960784313730279e-02 0.000000000000000000e+00)
(6.816930543639048157e-01 6.862745098039213509e-02 0.000000000000000000e+00)
(6.700434271459227986e-01 8.823529411764707842e-02 0.000000000000000000e+00)
(6.558161149051341399e-01 1.078431372549019107e-01 0.000000000000000000e+00)
(6.392267891925853540e-01 1.274509803921568540e-01 0.000000000000000000e+00)
(6.205269272758512367e-01 1.470588235294117974e-01 0.000000000000000000e+00)
(6.000000000000000888e-01 1.666666666666666297e-01 0.000000000000000000e+00)
(5.779571746585359104e-01 1.862745098039215730e-01 0.000000000000000000e+00)
(5.547325980144166557e-01 2.058823529411764053e-01 0.000000000000000000e+00)
(5.306783309757371336e-01 2.254901960784313486e-01 0.000000000000000000e+00)
(5.061590117112341192e-01 2.450980392156862919e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 2.647058823529411242e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 2.843137254901960675e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 3.039215686274510109e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 3.235294117647058432e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 3.431372549019607865e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 3.627450980392157298e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 3.823529411764705621e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 4.019607843137255054e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 4.215686274509803377e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 4.411764705882352811e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 4.607843137254902244e-01 0.000000000000000000e+00)
(5.000000000000000000e-01 4.803921568627450567e-01 0.000000000000000000e+00)
)
spline 5 6
(
(5.000000000000000000e-01 -4.803921568627451122e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -4.607843137254902244e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -4.411764705882352811e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -4.215686274509803932e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -4.019607843137255054e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -3.823529411764705621e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -3.627450980392156743e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -3.431372549019607865e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -3.235294117647058987e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -3.039215686274510109e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -2.843137254901960675e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 -2.647058823529411797e-01 1.000000000000000021e-02)
(5.061590117112341192e-01 -2.450980392156862919e-01 1.000000000000000021e-02)
(5.306783309757371336e-01 -2.254901960784313486e-01 1.000000000000000021e-02)
(5.547325980144166557e-01 -2.058823529411764608e-01 1.000000000000000021e-02)
(5.779571746585359104e-01 -1.862745098039215730e-01 1.000000000000000021e-02)
(5.999999999999999778e-01 -1.666666666666666852e-01 1.000000000000000021e-02)
(6.205269272758512367e-01 -1.470588235294117974e-01 1.000000000000000021e-02)
(6.392267891925853540e-01 -1.274509803921568540e-01 1.000000000000000021e-02)
(6.558161149051340288e-01 -1.078431372549019662e-01 1.000000000000000021e-02)
(6.700434271459227986e-01 -8.823529411764707842e-02 1.000000000000000021e-02)
(6.816930543639048157e-01 -6.862745098039213509e-02 1.000000000000000021e-02)
(6.905884000854313198e-01 -4.901960784313724728e-02 1.000000000000000021e-02)
(6.965946199367804015e-01 -2.941176470588235947e-02 1.000000000000000021e-02)
(6.996206657474088875e-01 -9.803921568627471661e-03 1.000000000000000021e-02)
(6.996206657474088875e-01 9.803921568627416150e-03 1.000000000000000021e-02)
(6.965946199367804015e-01 2.941176470588235947e-02 1.000000000000000021e-02)
(6.905884000854313198e-01 4.901960784313730279e-02 1.000000000000000021e-02)
(6.816930543639048157e-01 6.862745098039213509e-02 1.000000000000000021e-02)
(6.700434271459227986e-01 8.823529411764707842e-02 1.000000000000000021e-02)
(6.558161149051341399e-01 1.078431372549019107e-01 1.000000000000000021e-02)
(6.392267891925853540e-01 1.274509803921568540e-01 1.000000000000000021e-02)
(6.205269272758512367e-01 1.470588235294117974e-01 1.000000000000000021e-02)
(6.000000000000000888e-01 1.666666666666666297e-01 1.000000000000000021e-02)
(5.779571746585359104e-01 1.862745098039215730e-01 1.000000000000000021e-02)
(5.547325980144166557e-01 2.058823529411764053e-01 1.000000000000000021e-02)
(5.306783309757371336e-01 2.254901960784313486e-01 1.000000000000000021e-02)
(5.061590117112341192e-01 2.450980392156862919e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 2.647058823529411242e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 2.843137254901960675e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 3.039215686274510109e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 3.235294117647058432e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 3.431372549019607865e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 3.627450980392157298e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 3.823529411764705621e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 4.019607843137255054e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 4.215686274509803377e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 4.411764705882352811e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 4.607843137254902244e-01 1.000000000000000021e-02)
(5.000000000000000000e-01 4.803921568627450567e-01 1.000000000000000021e-02)
)
);




boundary
(
    left
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    right
    {
    	type patch;
    	faces
    	(
    		(2 6 5 1)
    	);
    }

    up
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    down
    {
        type patch;
        faces
        (
            //(0 4 7 3)
            //(2 6 5 1)
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);